_Autor: Christian Camilo Urcuqui López_

_Fecha: agosto 2019_

<img height="200" width="200" src="http://dataanalyticsedge.com/wp-content/uploads/2018/05/img2.jpeg">

_Contenido_:
+ Repasar funciones básicas vistas en las clases pasadas (con un nuevo data set).
+ Comprender los pasos del proceso de limpieza.
+ Entender las principales fuentes de problemas en las bases de datos, sus implicaciones y la forma de solucionarlos.
+ Usar Python para limpiar un conjunto de datos (Taller guiado sobre limpieza de datos)

## Taller práctico


**Información**: Banco pequeño portugués que entre mayo de 2008 y junio de 2013 efectúo una campaña de mercadeo, vía telefónica, para aumentar la venta de depósitos a largo plazo. 

**Objetivo original**:

Predecir el éxito de las llamadas de telemercadeo para la venta de depósitos a largo plazo. Moro, S., Cortez, P., & Rita, P. (2014). (A data-driven approach to predict the success of bank telemarketing. _Decision Support Systems_, 62, 22-31.)

**Nuestro objetivo** : 
Limpiar la base de datos y responder:
¿Cuántas personas son propietarias de su casa y están en mora?
¿Cuántas personas tienen menos de 25 años y son estudiantes?
¿Cuántas personas tienen más de 60 años y están jubilados?


<img src="../../../Utilities/data_dic_exa1.png" >
<center> Fuente: S. Moro, R. Laureano and P. Cortez. Using Data Mining for Bank Direct Marketing: An Application of the CRISP-DM Methodology.  In P. Novais et al. (Eds.), Proceedings of the European Simulation and Modelling Conference - ESM'2011, pp. 117-121, Guimarães, Portugal, October, 2011. EUROSIS.</center>

### Importamos los paquetes

In [1]:
import pandas as pd
import numpy as np

### Cargamos la base de datos

In [2]:
data =  pd.read_csv("../../../datasets/bank-full-clase.csv", sep=";")
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 45211 entries, 0 to 45210
Data columns (total 20 columns):
edad         45203 non-null float64
job          45192 non-null object
marital      45199 non-null object
education    45189 non-null object
default      45206 non-null object
balance      45201 non-null float64
housing      45201 non-null object
loan         45201 non-null object
contact      45197 non-null object
day          45204 non-null float64
month        45204 non-null object
year         45211 non-null int64
child        45211 non-null object
no.hijos     45211 non-null int64
duration     45204 non-null float64
campaign     45211 non-null int64
pdays        45203 non-null float64
previous     45211 non-null int64
poutcome     45207 non-null object
y            45211 non-null object
dtypes: float64(5), int64(4), object(11)
memory usage: 6.9+ MB

### Dimensiones de la base de datos

Número de filas

In [9]:
data.shape[0]

45211

Número de columnas

In [10]:
data.shape[1]

20

Número de filas y columnas

In [13]:
data.shape

(45211, 20)

head: visualiza las primeras filas de la bd

In [16]:
data.head(10)

,edad,job,marital,education,default,balance,housing,loan,contact,day,month,year,child,no.hijos,duration,campaign,pdays,previous,poutcome,y
0,58.0,management,married,tertiary,no,2143.0,yes,no,unknown,5.0,may,2009,yes,1,261.0,1,-1.0,0,unknown,no
1,44.0,technician,single,secondary,no,29.0,yes,no,unknown,5.0,may,2009,yes,3,151.0,1,-1.0,0,unknown,no
2,33.0,entrepreneur,married,secondary,no,2.0,yes,yes,unknown,5.0,may,2012,no,0,76.0,1,-1.0,0,unknown,no
3,47.0,blue-collar,married,unknown,no,1506.0,yes,no,unknown,5.0,may,2013,no,0,92.0,1,-1.0,0,unknown,no
4,33.0,unknown,single,unknown,no,1.0,no,no,unknown,5.0,may,2011,yes,3,198.0,1,-1.0,0,unknown,no
5,35.0,management,married,tertiary,no,231.0,yes,no,unknown,5.0,may,2010,no,0,139.0,1,-1.0,0,unknown,no
6,28.0,management,single,tertiary,no,447.0,yes,yes,unknown,5.0,may,2011,yes,2,217.0,1,-1.0,0,unknown,no
7,42.0,entrepreneur,divorced,tertiary,yes,2.0,yes,no,unknown,5.0,may,2009,no,0,380.0,1,-1.0,0,unknown,no
8,58.0,retired,married,primary,no,121.0,yes,no,unknown,5.0,may,2012,yes,4,50.0,1,-1.0,0,unknown,no
9,43.0,technician,single,secondary,no,593.0,yes,no,unknown,5.0,may,2012,yes,4,55.0,1,-1.0,0,unknown,no

tail: visualiza las últimas filas de la bd

In [15]:
data.tail()

,edad,job,marital,education,default,balance,housing,loan,contact,day,month,year,child,no.hijos,duration,campaign,pdays,previous,poutcome,y
45206,51.0,technician,married,tertiary,no,825.0,no,no,cellular,17.0,nov,2010,yes,1,977.0,3,-1.0,0,unknown,yes
45207,71.0,retired,divorced,primary,No,NaN,no,no,cellular,17.0,nov,2013,yes,4,456.0,2,-1.0,0,unknown,yes
45208,72.0,retired,married,secondary,no,5715.0,no,no,cellular,17.0,nov,2010,no,0,1127.0,5,184.0,3,success,yes
45209,57.0,blue-collar,married,secondary,no,668.0,no,no,telephone,17.0,nov,2009,no,0,508.0,4,-1.0,0,unknown,no
45210,37.0,entrepreneur,married,secondary,no,2971.0,no,no,cellular,17.0,nov,2010,yes,4,361.0,2,188.0,11,other,no

**Observación** contamos con dos columnas que tienen nombres que no pertenecen al diccionario de variables:

+ edad
+ no.hijos

### ¿Cómo cambiarle el nombre a las variables?

In [25]:
data.columns

Index(['edad', 'job', 'marital', 'education', 'default', 'balance', 'housing',
       'loan', 'contact', 'day', 'month', 'year', 'child', 'no.hijos',
       'duration', 'campaign', 'pdays', 'previous', 'poutcome', 'y'],
      dtype='object')

Forma No.1 de cambiar los nombres

In [31]:
"""
data = data.rename({'edad': 'age', 'job': 'job', 'marital': 'marital', 'education': 'education',
                     'default': 'default', 'balance': 'balance', 'housing': 'housing', 'loan': 'loan',
                     'contact': 'contact', 'day': 'day', 'month': 'month', 'year': 'year', 
                     'child': 'child', 'no.hijos': 'num.child','duration': 'duration', 
                     'campaign': 'campaign', 'pdays': 'pdays', 'previous': 'previous', 
                     'poutcome': 'poutcome', 'y': 'y'}, axis="columns")
"""
data = data.rename({'edad': 'age', 'no.hijos': 'num.child'}, axis="columns")
data.columns

Index(['age', 'job', 'marital', 'education', 'default', 'balance', 'housing',
       'loan', 'contact', 'day', 'month', 'year', 'child', 'num.child',
       'duration', 'campaign', 'pdays', 'previous', 'poutcome', 'y'],
      dtype='object')

Forma No.2 de cambiar los nombres

In [41]:
data.columns = ['age', 'job', 'marital', 'education', 'default', 'balance', 'housing',
       'loan', 'contact', 'day', 'month', 'year', 'num.child', 'no.hijos',
       'duration', 'campaign', 'pdays', 'previous', 'poutcome', 'y']
data.columns

Index(['age', 'job', 'marital', 'education', 'default', 'balance', 'housing',
       'loan', 'contact', 'day', 'month', 'year', 'num.child', 'no.hijos',
       'duration', 'campaign', 'pdays', 'previous', 'poutcome', 'y'],
      dtype='object')

### Identificar el formato de la variable

Clases de variables en la base de datos y un vistazo a su contenido:

In [43]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 45211 entries, 0 to 45210
Data columns (total 20 columns):
age          45203 non-null float64
job          45192 non-null object
marital      45199 non-null object
education    45189 non-null object
default      45206 non-null object
balance      45201 non-null float64
housing      45201 non-null object
loan         45201 non-null object
contact      45197 non-null object
day          45204 non-null float64
month        45204 non-null object
year         45211 non-null int64
num.child    45211 non-null object
no.hijos     45211 non-null int64
duration     45204 non-null float64
campaign     45211 non-null int64
pdays        45203 non-null float64
previous     45211 non-null int64
poutcome     45207 non-null object
y            45211 non-null object
dtypes: float64(5), int64(4), object(11)
memory usage: 6.9+ MB

Sólo saber qué clase de variables son:

In [48]:
data.dtypes

age          float64
job           object
marital       object
education     object
default       object
balance      float64
housing       object
loan          object
contact       object
day          float64
month         object
year           int64
num.child     object
no.hijos       int64
duration     float64
campaign       int64
pdays        float64
previous       int64
poutcome      object
y             object
dtype: object

In [61]:
pd.crosstab(data.dtypes,data.dtypes)

col_0    int64  float64  object
row_0
int64        4        0       0
float64      0        5       0
object       0        0      11

¿Cuántas variables hay de cada tipo en la base de datos de bancos?

In [62]:
data.dtypes.value_counts()

object     11
float64     5
int64       4
dtype: int64

#### No correspondencia entre el formato de la variable y su tipo

In [68]:
data.age.astype("category").describe()

count     45203.0
unique       83.0
top          32.0
freq       2085.0
Name: age, dtype: float64

In [74]:
data.age.describe()

count    45203.000000
mean        40.937172
std         10.638905
min         10.000000
25%         33.000000
50%         39.000000
75%         48.000000
max        158.000000
Name: age, dtype: float64

**Solución**: convertir la variable a su formato correcto

_Convertir de formato factor a carácter_

In [76]:
data.job = data.job.astype("object")

_Convertir de formato  carácter a formato factor_

In [77]:
data.job = data.job.astype("category")

_Convertir variable de formato factor a numérico_

In [80]:
data.balance = data.balance.astype("float64")

_Convertir variable de formato entero a numérico_

In [83]:
data.balance = pd.to_numeric(data.balance)

_Convertir varias columnas a la vez_

In [102]:
columnas = ["marital", "education", "default", "housing",
            "loan", "contact", "month", "poutcome", "y"]
data.loc[:, columnas] = data.loc[:, columnas].astype("category")

In [104]:
data.dtypes

age           float64
job          category
marital      category
education    category
default      category
balance       float64
housing      category
loan         category
contact      category
day           float64
month        category
year            int64
child          object
num.child       int64
duration      float64
campaign        int64
pdays         float64
previous        int64
poutcome     category
y            category
dtype: object

#### Caso especial fechas

In [4]:
from datetime import datetime

In [17]:
nacimiento = datetime.strptime("1989-01-03", "%Y-%m-%d")
nacimiento

datetime.datetime(1989, 1, 3, 0, 0)

In [20]:
nacimiento = datetime(1989,3,1)
nacimiento

datetime.datetime(1989, 3, 1, 0, 0)

¿Cuántos días han pasado desde que nació?

In [25]:
(datetime.today()- nacimiento).days

11122

In [27]:
type(datetime.today() - nacimiento)

datetime.timedelta

¿Cuántos segundos (timedelta provee un método para calcularlo) han pasado desde que nació?

In [38]:
(datetime.today() - nacimiento).total_seconds()

960970821.024481

### Respaldo - copia de DataFrame

En ocasiones será necesario mantener un respaldo o copias de los DataFrame, algunas de las razones son:
+ Mantener el objeto como raw data 
+ Versionar los resultados del proceso de limpieza

In [38]:
data_copy = data.copy()

### Observaciones duplicadas

In [39]:
data_copy.duplicated().value_counts()

False    45211
dtype: int64

In [40]:
data_copy[data_copy.duplicated()==False].shape

(45211, 20)

### Detección de valores perdidos

In [41]:
data_copy.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 45211 entries, 0 to 45210
Data columns (total 20 columns):
age          45203 non-null float64
job          45192 non-null object
marital      45199 non-null object
education    45189 non-null object
default      45206 non-null object
balance      45201 non-null float64
housing      45201 non-null object
loan         45201 non-null object
contact      45197 non-null object
day          45204 non-null float64
month        45204 non-null object
year         45211 non-null int64
child        45211 non-null object
num.child    45211 non-null int64
duration     45204 non-null float64
campaign     45211 non-null int64
pdays        45203 non-null float64
previous     45211 non-null int64
poutcome     45207 non-null object
y            45211 non-null object
dtypes: float64(5), int64(4), object(11)
memory usage: 6.9+ MB

Obtenemos la cantidad de registros con valores perdidos

In [44]:
data_copy.isnull().sum()
#data_copy.isnull().sum().sum()
#data_copy.isna().sum().sum()

age           8
job          19
marital      12
education    22
default       5
balance      10
housing      10
loan         10
contact      14
day           7
month         7
year          0
child         0
num.child     0
duration      7
campaign      0
pdays         8
previous      0
poutcome      4
y             0
dtype: int64

In [8]:
# elimina todos los registros que tengan por lo menos un NaN en una variable
print("Dimensiones del DataFrame con NaN: {}".format(data_copy.shape))
print("Dimensiones del DataFrame sin NaN: {}".format(data_copy.dropna().shape))
data_copy = data_copy.dropna().copy()

Dimensiones del DataFrame con NaN: (45211, 20)
Dimensiones del DataFrame sin NaN: (45069, 20)

In [50]:
# elimina los registros de una sola variable
data_copy[data_copy.age.notnull()].shape
#data_copy.loc[data_copy.age.notnull()].shape

(45203, 20)

Cambiando los datos de una sola variable

In [53]:
data_copy.loc[data_copy.age.isnull(), 'age']

36430   NaN
36511   NaN
37234   NaN
38443   NaN
39670   NaN
40341   NaN
40754   NaN
45052   NaN
Name: age, dtype: float64

In [54]:
data_copy.loc[data_copy.age.isnull(), 'age'] = 99

In [56]:
data_copy.loc[data_copy.age.isnull(), 'age']
# no hay más NaN ya que los reemplzamos con 99

Series([], Name: age, dtype: float64)

**Agregando y eliminando una columna (variable).**

_Suponga que deseamos crear una variable categórica "aprobacion" que tenga dos valores "si" y "no" y que sea dependiente de la siguiente condición: si el balance es mayor a 1500 y no tiene hijos entonces el valor es "si", en otra circunstancia es "no"_

In [10]:
data_copy['aprobacion'] = np.where((data_copy.balance > 1500) & (data_copy.child=="no"), "si", "no")

In [11]:
data_copy['aprobacion'].head()

0    no
1    no
2    no
3    si
4    no
Name: aprobacion, dtype: object

_eliminando una variable_

In [2]:
data_copy.columns

Index(['age', 'job', 'marital', 'education', 'default', 'balance', 'housing',
       'loan', 'contact', 'day', 'month', 'year', 'child', 'num.child',
       'duration', 'campaign', 'pdays', 'previous', 'poutcome', 'y',
       'aprobacion'],
      dtype='object')

In [8]:
data_copy = data_copy.drop(axis=1, columns=["aprobacion"])
data_copy.columns

Index(['age', 'job', 'marital', 'education', 'default', 'balance', 'housing',
       'loan', 'contact', 'day', 'month', 'year', 'child', 'num.child',
       'duration', 'campaign', 'pdays', 'previous', 'poutcome', 'y'],
      dtype='object')

## Ejemplo de imputación

Vamos a cargar la base de datos de iris que nos trae el paquete de sckitlearn

In [39]:
df = pd.read_csv('https://archive.ics.uci.edu/ml/machine-learning-databases/iris/iris.data', 
                 header=None,
                 names=["sepal_length","sepal_width", "petal_length","petal_width","class"])
df.columns

Index(['sepal_length', 'sepal_width', 'petal_length', 'petal_width', 'class'], dtype='object')

In [40]:
df.loc[0:10, 'sepal_length'] = np.nan
df.loc[40:50, 'sepal_width'] = np.nan
df.loc[70:90, 'petal_width'] = np.nan
df.describe()

       sepal_length  sepal_width  petal_length  petal_width
count    139.000000   139.000000    150.000000   129.000000
mean       5.917266     3.033094      3.758667     1.171318
std        0.811058     0.428409      1.764420     0.815685
min        4.300000     2.000000      1.000000     0.100000
25%        5.200000     2.800000      1.600000     0.200000
50%        5.900000     3.000000      4.350000     1.300000
75%        6.450000     3.300000      5.100000     1.900000
max        7.900000     4.400000      6.900000     2.500000

In [41]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
sepal_length    139 non-null float64
sepal_width     139 non-null float64
petal_length    150 non-null float64
petal_width     129 non-null float64
class           150 non-null object
dtypes: float64(4), object(1)
memory usage: 5.9+ KB

_Forma 1_

In [42]:
df.loc[df.petal_width.isnull(), 'petal_width'] = df.petal_width.mean()

In [43]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
sepal_length    139 non-null float64
sepal_width     139 non-null float64
petal_length    150 non-null float64
petal_width     150 non-null float64
class           150 non-null object
dtypes: float64(4), object(1)
memory usage: 5.9+ KB

_Forma 2_

In [44]:
df.sepal_width.fillna(df.sepal_width.mean(), inplace=True)

In [45]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
sepal_length    139 non-null float64
sepal_width     150 non-null float64
petal_length    150 non-null float64
petal_width     150 non-null float64
class           150 non-null object
dtypes: float64(4), object(1)
memory usage: 5.9+ KB

## Errores de digitación

In [67]:
data_copy.columns

Index(['age', 'job', 'marital', 'education', 'default', 'balance', 'housing',
       'loan', 'contact', 'day', 'month', 'year', 'child', 'num.child',
       'duration', 'campaign', 'pdays', 'previous', 'poutcome', 'y',
       'aprobacion'],
      dtype='object')

In [69]:
data_copy.job.value_counts()

blue-collar      9695
management       9431
technician       7583
admin.           5145
services         4145
retired          2250
self-employed    1577
entrepreneur     1485
unemployed       1298
housemaid        1238
student           935
unknown           287
Name: job, dtype: int64

In [71]:
data_copy.marital.value_counts()
# aca podemos encontrar un error

married        27127
single         12750
divorced        5185
  married          4
   married         2
    married        1
Name: marital, dtype: int64

In [74]:
data_copy.job.value_counts()

blue-collar      9695
management       9431
technician       7583
admin.           5145
services         4145
retired          2250
self-employed    1577
entrepreneur     1485
unemployed       1298
housemaid        1238
student           935
unknown           287
Name: job, dtype: int64

In [73]:
data_copy.education.value_counts()

secondary    23128
tertiary     13262
primary       6828
unknown       1851
Name: education, dtype: int64

In [75]:
data_copy.default.value_counts()
# aca hay otro error

no     44248
yes      811
No         4
nO         3
YES        1
N          1
Yes        1
Name: default, dtype: int64

In [76]:
data_copy.housing.value_counts()
# aca hay otro error

yes    25044
no     20023
YES        1
No         1
Name: housing, dtype: int64

_tratamiento_

In [93]:
data_copy.housing = data_copy.housing.str.lower()
data_copy.marital = data_copy.marital.str.strip()
data_copy.default = data_copy.default.str.lower()
data_copy.loc[(data_copy.default == "N") | (data_copy.default =="n"), 'default'] = "no"

In [106]:
data_copy.marital.value_counts()

married     27134
single      12750
divorced     5185
Name: marital, dtype: int64

In [107]:
data_copy.default.value_counts()

no     44256
yes      813
Name: default, dtype: int64

In [108]:
data_copy.housing.value_counts()

yes    25045
no     20024
Name: housing, dtype: int64

## Valores inconsistentes

¿Qué relaciones entre variables podríamos revisar?

Por ejemplo, que las personas que respondieron que no tenían hijos, hayan respondido 0 en el número de hijos

In [129]:
pd.crosstab(data_copy.loc[:,'child'], data_copy.loc[:,'num.child'], 
            rownames=['Has children?'], colnames=["Number of child"],
            margins=True, margins_name="Total")

Number of child      0     1     2     3     4  20  Total
Has children?
no               22400     2     2     0     0   0  22404
yes                  0  5754  5570  5734  5606   1  22665
Total            22400  5756  5572  5734  5606   1  45069

_solución_

In [131]:
data_copy.loc[(data_copy.child =="no") & (data_copy.loc[:,'num.child'] > 0),'child'] = np.nan

In [136]:
pd.crosstab(data_copy.loc[:,'child'], data_copy.loc[:,'num.child'], 
            rownames=['Has children?'], colnames=["Number of child"],
            margins=True, margins_name="Total")

Number of child      0     1     2     3     4  20  Total
Has children?
no               22400     0     0     0     0   0  22400
yes                  0  5754  5570  5734  5606   1  22665
Total            22400  5754  5570  5734  5606   1  45065

## Valores sin referencia en el diccionario de variables

## Creación de nuevas variables

In [164]:
data_copy['dyf'] = pd.Series(np.where((data_copy.default == "yes") & (data_copy.housing=="yes"),1,0))

In [166]:
data_copy.dyf.value_counts()

0.0    44496
1.0      432
Name: dyf, dtype: int64

In [143]:
data_copy.columns

Index(['age', 'job', 'marital', 'education', 'default', 'balance', 'housing',
       'loan', 'contact', 'day', 'month', 'year', 'child', 'num.child',
       'duration', 'campaign', 'pdays', 'previous', 'poutcome', 'y',
       'aprobacion'],
      dtype='object')

In [20]:
data.job.isna().value_counts()

False    45192
True        19
Name: job, dtype: int64

In [163]:
import pandas as pd
import numpy as np
data =  pd.read_csv("../../../datasets/bank-full-clase.csv", sep=";")
data = data.rename({'edad': 'age', 'no.hijos': 'num.child'}, axis="columns")
data.job = data.job.astype("category")
columnas = ["marital", "education", "default", "housing",
            "loan", "contact", "month", "poutcome", "y"]
data.loc[:, columnas] = data.loc[:, columnas].astype("category")
data_copy = data.copy()
data_copy = data_copy.dropna().copy()
data_copy['aprobacion'] = np.where((data_copy.balance > 1500) & (data_copy.child=="no"), "si", "no")
data_copy.housing = data_copy.housing.str.lower()
data_copy.marital = data_copy.marital.str.strip()
data_copy.default = data_copy.default.str.lower()
data_copy.loc[(data_copy.default == "N") | (data_copy.default =="n"), 'default'] = "no"

In [6]:
data_copy.head()

,age,job,marital,education,default,balance,housing,loan,contact,day,month,year,child,num.child,duration,campaign,pdays,previous,poutcome,y
0,58.0,management,married,tertiary,no,2143.0,yes,no,unknown,5.0,may,2009,yes,1,261.0,1,-1.0,0,unknown,no
1,44.0,technician,single,secondary,no,29.0,yes,no,unknown,5.0,may,2009,yes,3,151.0,1,-1.0,0,unknown,no
2,33.0,entrepreneur,married,secondary,no,2.0,yes,yes,unknown,5.0,may,2012,no,0,76.0,1,-1.0,0,unknown,no
3,47.0,blue-collar,married,unknown,no,1506.0,yes,no,unknown,5.0,may,2013,no,0,92.0,1,-1.0,0,unknown,no
4,33.0,unknown,single,unknown,no,1.0,no,no,unknown,5.0,may,2011,yes,3,198.0,1,-1.0,0,unknown,no